tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
    esp_err_t ret = nvs_open(USER_WORK_STATE_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "open work state nvs for write failed: %s", esp_err_to_name(ret));
        return ret;
    }

    ret = nvs_set_blob(handle, USER_WORK_STATE_NVS_KEY, &blob, sizeof(blob));
    if (ret == ESP_OK) {
        ret = nvs_commit(handle);
    }
    nvs_close(handle);

    if (ret == ESP_OK) {
        user_work_state_nvs_blob_t read_blob = {0};
        size_t stored_size = 0;
        log_work_state_blob("save value", &blob);
        esp_err_t read_ret = load_work_state_from_nvs(&read_blob, &stored_size);
        if (read_ret == ESP_OK && memcmp(&blob, &read_blob, sizeof(blob)) == 0) {
            ESP_LOGI(TAG, "work state verify ok stored_size=%u", (unsigned int)stored_size);
        } else {
            ESP_LOGW(TAG, "work state verify failed read_ret=%s stored_size=%u",
                     esp_err_to_name(read_ret), (unsigned int)stored_size);
        }
    } else {
        ESP_LOGE(TAG, "save work state failed: %s", esp_err_to_name(ret));
    }
    return ret;
}

static bool parse_app_nvs_u32(const char *value, uint32_t *out_value)
{
    char *end_ptr = NULL;
    unsigned long parsed = 0;

    if (value == NULL || out_value == NULL || value[0] == '\0') {
        return false;
    }

    errno = 0;
    parsed = strtoul(value, &end_ptr, 10);
    if (errno != 0 || end_ptr == value || *end_ptr != '\0' || parsed > UINT32_MAX) {
        return false;
    }

    *out_value = (uint32_t)parsed;
    return true;
}

static esp_err_t save_work_time_vars_to_app_nvs(void)
{
    char value[16];
    esp_err_t ret = ESP_OK;
    esp_err_t write_ret = ESP_OK;

    snprintf(value, sizeof(value), "%lu", (unsigned long)server_required_continue_work_time);
    write_ret = app_nvs_write_str(SERVER_REQUIRED_CONTINUE_WORK_TIME_NVS_KEY, value);
    if (write_ret != ESP_OK && ret == ESP_OK) {
        ret = write_ret;
    }

    snprintf(value, sizeof(value), "%lu", (unsigned long)wifi_standby_time_s);
    write_ret = app_nvs_write_str(WIFI_STANDBY_TIME_S_NVS_KEY, value);
    if (write_ret != ESP_OK && ret == ESP_OK) {
        ret = write_ret;
    }

    ESP_LOGI(TAG, "save app nvs continue=%lu standby=%lu ret=%s",
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s,
             esp_err_to_name(ret));
    return ret;
}

static void load_work_time_vars_from_app_nvs(void)
{
    char value[16];
    char default_value[16];
    uint32_t parsed = 0;

    snprintf(default_value, sizeof(default_value), "%lu",
             (unsigned long)server_required_continue_work_time);
    if (app_nvs_read_str(SERVER_REQUIRED_CONTINUE_WORK_TIME_NVS_KEY,
                         value,
                         sizeof(value),
                         default_value) == ESP_OK &&
        parse_app_nvs_u32(value, &parsed)) {
        server_required_continue_work_time = clamp_continue_seconds(parsed);
    }

    snprintf(default_value, sizeof(default_value), "%lu",
             (unsigned long)wifi_standby_time_s);
    if (app_nvs_read_str(WIFI_STANDBY_TIME_S_NVS_KEY,
                         value,
                         sizeof(value),
                         default_value) == ESP_OK &&
        parse_app_nvs_u32(value, &parsed)) {
        wifi_standby_time_s = parsed;
    }

    ESP_LOGI(TAG, "load app nvs continue=%lu standby=%lu",
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s);
}

static uint32_t update_working_time_seconds(void)
{
    TickType_t now = xTaskGetTickCount();
    if (s_wifi_work_start_tick == 0) {
        s_wifi_work_start_tick = now;
    }
    working_time = (uint32_t)(((now - s_wifi_work_start_tick) * portTICK_PERIOD_MS) / 1000U);
    return working_time;
}

static uint32_t http_activity_hold_remaining_seconds(TickType_t now)
{
    uint32_t encoded_tick = __atomic_load_n(&s_last_http_activity_tick_encoded, __ATOMIC_ACQUIRE);
    if (encoded_tick == 0) {
        return 0;
    }

    TickType_t last_tick = (TickType_t)(encoded_tick - 1U);
    TickType_t hold_ticks = pdMS_TO_TICKS(USER_WORK_STATE_HTTP_ACTIVITY_HOLD_SECONDS * 1000U);
    TickType_t elapsed_ticks = now - last_tick;
    if (elapsed_ticks >= hold_ticks) {
        return 0;
    }

    uint32_t remaining_ms = (uint32_t)((hold_ticks - elapsed_ticks) * portTICK_PERIOD_MS);
    return (remaining_ms + 999U) / 1000U;
}

static uint32_t ch583_activity_hold_remaining_seconds(TickType_t now)
{
    uint32_t encoded_tick = __atomic_load_n(&s_last_ch583_activity_tick_encoded, __ATOMIC_ACQUIRE);
    if (encoded_tick == 0) {
        return 0;
    }

    TickType_t last_tick = (TickType_t)(encoded_tick - 1U);
    TickType_t hold_ticks = pdMS_TO_TICKS(USER_WORK_STATE_CH583_ACTIVITY_HOLD_SECONDS * 1000U);
    TickType_t elapsed_ticks = now - last_tick;
    if (elapsed_ticks >= hold_ticks) {
        return 0;
    }

    uint32_t remaining_ms = (uint32_t)((hold_ticks - elapsed_ticks) * portTICK_PERIOD_MS);
    return (remaining_ms + 999U) / 1000U;
}

//调用   ServerNetworkStaWifiWorkTime_OnNetworkData  从头计
// Configure CH583/CH585 wake timer before POWER_OFF so slideshow can resume after power cut.
static uint32_t slideshow_startup_delay_seconds(void)
{
    return (TDX_SLIDESHOW_STARTUP_DELAY_MS + 999U) / 1000U;
}

static uint32_t slideshow_wake_advance_seconds(uint32_t *startup_delay_out)
{
    uint32_t startup_delay = slideshow_startup_delay_seconds();
    if (startup_delay_out != NULL) {
        *startup_delay_out = startup_delay;
    }
    return startup_delay + TDX_SLIDESHOW_WAKE_EXTRA_ADVANCE_SECONDS;
}

static void reset_work_time_counter_for_slideshow_short_interval(void)
{
    s_wifi_work_start_tick = xTaskGetTickCount();
    working_time = 0;
}

static bool restore_work_time_after_one_shot_skip(uint8_t expected_state)
{
    portENTER_CRITICAL(&s_one_shot_power_off_mux);
    uint8_t current_state =
        __atomic_load_n(&s_one_shot_power_off_state, __ATOMIC_ACQUIRE);
    if (current_state != expected_state) {
        portEXIT_CRITICAL(&s_one_shot_power_off_mux);
        return false;
    }
    server_required_continue_work_time = s_one_shot_restore_continue_time;
    wifi_standby_time_s = s_one_shot_restore_standby_time;
    working_time = 0;
    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    __atomic_store_n(&s_one_shot_power_off_state, 0, __ATOMIC_RELEASE);
    portEXIT_CRITICAL(&s_one_shot_power_off_mux);
    UserLedStatus_SetPowerOffPending(false);
    EpdSdPowerTest_CommitStayAwake("one_shot_power_off_canceled");
    return true;
}

static const char *one_shot_owner_to_string(uint8_t owner)
{
    switch (owner) {
    case USER_WORK_STATE_ONE_SHOT_DAILY_OWNER_BIT:
        return "DAILY";
    case USER_WORK_STATE_ONE_SHOT_SLIDESHOW_OWNER_BIT:
        return "SLIDESHOW";
    case USER_WORK_STATE_ONE_SHOT_LOCAL_IMAGE_OWNER_BIT:
        return "LOCAL_IMAGE";
    default:
        return "GENERIC";
    }
}

static bool should_skip_or_cancel_one_shot_power_off(void)
{
    uint8_t one_shot_state =
        __atomic_load_n(&s_one_shot_power_off_state, __ATOMIC_ACQUIRE);
    if ((one_shot_state & USER_WORK_STATE_ONE_SHOT_ACTIVE_BIT) == 0) {
        return false;
    }

    uint8_t mode = EpdDisplayMode_Get();
    uint8_t owner = one_shot_state & USER_WORK_STATE_ONE_SHOT_OWNER_MASK;
    bool owner_matches_mode =
        (owner == USER_WORK_STATE_ONE_SHOT_DAILY_OWNER_BIT &&
         mode == USER_EPD_DISPLAY_MODE_DAILY) ||
        (owner == USER_WORK_STATE_ONE_SHOT_SLIDESHOW_OWNER_BIT &&
         mode == USER_EPD_DISPLAY_MODE_SLIDESHOW) ||
        (owner == USER_WORK_STATE_ONE_SHOT_LOCAL_IMAGE_OWNER_BIT &&
         mode == USER_EPD_DISPLAY_MODE_LOCAL_IMAGE_BROWSING);
    /* Generic EPD one-shots intentionally keep their mode-independent behavior. */
    if (owner != 0 && !owner_matches_mode) {
        if (!restore_work_time_after_one_shot_skip(one_shot_state)) {
            return true;
        }
        ESP_LOGI(TAG,
                 "owned one-shot power off canceled owner=%s mode=%u(%s) restore_continue=%lu restore_standby=%lu",
                 one_shot_owner_to_string(owner),
                 (unsigned int)mode,
                 EpdDisplayMode_ToString(mode),
                 (unsigned long)server_required_continue_work_time,
                 (unsigned long)wifi_standby_time_s);
        return true;
    }

    if (mode != USER_EPD_DISPLAY_MODE_SLIDESHOW) {
        ESP_LOGI(TAG,
                 "one-shot power off skip slideshow remain check mode=%u(%s)",
                 (unsigned int)mode,
                 EpdDisplayMode_ToString(mode));
        return false;
    }

    uint32_t interval = 0;
    uint32_t elapsed = 0;
    uint32_t remain = 0;
    int64_t now_epoch = 0;
    int64_t next_epoch = 0;
    bool running = false;
    if (ServerNetworkStaSlideshow_GetScheduleTiming(&interval,
                                                    &now_epoch,
                                                    &next_epoch,
                                                    &remain,
                                                    &running) &&
        running) {
        char now_text[32] = {0};
        char next_text[32] = {0};
        format_epoch_local(now_epoch, now_text, sizeof(now_text));
        format_epoch_local(next_epoch, next_text, sizeof(next_text));
        if (remain <= USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS) {
            ESP_LOGI(TAG,
                     "one-shot power off skipped because slideshow next is soon remain=%lu min=%lu now=%lld(%s) next=%lld(%s)",
                     (unsigned long)remain,
                     (unsigned long)USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS,
                     (long long)now_epoch,
                     now_text,
                     (long long)next_epoch,
                     next_text);
            if (!restore_work_time_after_one_shot_skip(one_shot_state)) {
                return true;
            }
            return true;
        }
        ESP_LOGI(TAG,
                 "one-shot power off allowed by slideshow rtc remain=%lu min=%lu now=%lld(%s) next=%lld(%s)",
                 (unsigned long)remain,
                 (unsigned long)USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS,
                 (long long)now_epoch,
                 now_text,
                 (long long)next_epoch,
                 next_text);
        return false;
    }

    if (ServerNetworkStaSlideshow_GetRuntimeTiming(&interval, &elapsed, &running) &&
        running) {
        remain = interval > elapsed ? interval - elapsed : 0;
        if (remain <= USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS) {
            ESP_LOGI(TAG,
                     "one-shot power off skipped because slideshow next is soon remain=%lu min=%lu interval=%lu elapsed=%lu",
                     (unsigned long)remain,
                     (unsigned long)USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS,
                     (unsigned long)interval,
                     (unsigned long)elapsed);
            if (!restore_work_time_after_one_shot_skip(one_shot_state)) {
                return true;
            }
            return true;
        }
        ESP_LOGI(TAG,
                 "one-shot power off allowed by slideshow runtime remain=%lu min=%lu interval=%lu elapsed=%lu",
                 (unsigned long)remain,
                 (unsigned long)USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS,
                 (unsigned long)interval,
                 (unsigned long)elapsed);
    }
    return false;
}

static bool configure_ch583_wake_timer_before_power_off(bool *slideshow_enabled_out,
                                                        uint32_t factory_reset_wake_seconds)
{
    uint32_t interval = TDX_SLIDESHOW_INTERVAL_MIN_SECONDS;
    bool random = false;
    uint8_t epd_mode = EpdDisplayMode_Get();
    bool daily_on = epd_mode == USER_EPD_DISPLAY_MODE_DAILY;
    bool slideshow_on =
        epd_mode == USER_EPD_DISPLAY_MODE_SLIDESHOW &&
        ServerNetworkStaSlideshow_IsSavedEnabled("/data", &interval, &random);
    bool wake_timer_on = false;
    int wake_ret;

    if (slideshow_enabled_out != NULL) {
        // Reuse this exact snapshot for the WIFI_PROVISION notification so the
        // wake-timer decision and reported shutdown mode cannot disagree.
        *slideshow_enabled_out = slideshow_on;
    }

    if (factory_reset_wake_seconds > 0) {
        if (slideshow_enabled_out != NULL) {
            *slideshow_enabled_out = false;
        }
        ESP_LOGI(TAG,
                 "factory reset wake timer on interval=%lu",
                 (unsigned long)factory_reset_wake_seconds);
        wake_ret = ch583_wifi_uart_send_wake_timer_on(factory_reset_wake_seconds);
        if (wake_ret < 0) {
            ESP_LOGE(TAG,
                     "factory reset power off postponed because CH583 wake timer failed ret=%d",
                     wake_ret);
            return false;
        }
        wake_timer_on = true;
    } else if (daily_on) {
        uint32_t wake_interval = 0;
        bool keep_awake = true;
        esp_err_t daily_ret =
            ServerNetworkStaDailyImage_GetPowerOffWakeSeconds(&wake_interval,
                                                               &keep_awake);
        if (daily_ret != ESP_OK) {
            ESP_LOGE(TAG,
                     "daily power off postponed because schedule is unavailable ret=%s",
                     esp_err_to_name(daily_ret));
            return false;
        }
        if (keep_awake) {
            ESP_LOGI(TAG, "daily power off postponed for due run window");
            EpdSdPowerTest_CommitStayAwake("daily_due_run_window");
            return false;
        }
        ESP_LOGI(TAG, "daily wake timer on interval=%lu advance=%u",
                 (unsigned long)wake_interval,
                 (unsigned int)USER_DAILY_IMAGE_WAKE_ADVANCE_SECONDS);
        wake_ret = ch583_wifi_uart_send_wake_timer_on(wake_interval);
        if (wake_ret < 0) {
            ESP_LOGE(TAG,
                     "daily power off postponed because CH583 wake timer failed ret=%d",
                     wake_ret);
            return false;
        }
        wake_timer_on = true;
    } else if (slideshow_on) {
        if (interval < TDX_SLIDESHOW_INTERVAL_MIN_SECONDS ||
            interval > TDX_SLIDESHOW_INTERVAL_MAX_SECONDS) {
            interval = TDX_SLIDESHOW_INTERVAL_MIN_SECONDS;
        }

        uint32_t runtime_interval = 0;
        uint32_t runtime_elapsed = 0;
        bool runtime_running = false;
        uint32_t wake_interval = interval;
        uint32_t startup_delay = 0;
        uint32_t wake_advance = slideshow_wake_advance_seconds(&startup_delay);
        int64_t schedule_now = 0;
        int64_t schedule_next = 0;
        uint32_t schedule_remain = 0;
        if (ServerNetworkStaSlideshow_GetScheduleTiming(&runtime_interval,
                                                        &schedule_now,
                                                        &schedule_next,
                                                        &schedule_remain,
                                                        &runtime_running) &&
            runtime_running) {
            wake_interval = schedule_remain > 0 ? schedule_remain : 1U;
            runtime_elapsed = runtime_interval > schedule_remain ?
                              runtime_interval - schedule_remain :
                              0;
            char now_text[32] = {0};
            char next_text[32] = {0};
            format_epoch_local(schedule_now, now_text, sizeof(now_text));
            format_epoch_local(schedule_next, next_text, sizeof(next_text));
            ESP_LOGI(TAG,
                     "slideshow rtc wake timing now=%lld(%s) next=%lld(%s) remain=%lu interval=%lu",
                     (long long)schedule_now,
                     now_text,
                     (long long)schedule_next,
                     next_text,
                     (unsigned long)schedule_remain,
                     (unsigned long)runtime_interval);
        } else if (ServerNetworkStaSlideshow_GetRuntimeTiming(&runtime_interval,
                                                              &runtime_elapsed,
                                                              &runtime_running) &&
                   runtime_running &&
                   runtime_interval > 0) {
            wake_interval = runtime_interval > runtime_elapsed ? runtime_interval - runtime_elapsed : 1U;
        }
        wake_interval = wake_interval > wake_advance ? wake_interval - wake_advance : 1U;

        uint8_t one_shot_state =
            __atomic_load_n(&s_one_shot_power_off_state, __ATOMIC_ACQUIRE);
        if ((one_shot_state & USER_WORK_STATE_ONE_SHOT_ACTIVE_BIT) == 0 &&
            wake_interval < TDX_SLIDESHOW_POWER_OFF_MIN_WAKE_INTERVAL_SECONDS) {
            reset_work_time_counter_for_slideshow_short_interval();
            EpdSdPowerTest_CommitStayAwake("slideshow_wake_interval_too_short");
            ESP_LOGI(TAG,
                     "slideshow wake interval too short, skip power off wake_interval=%lu min=%lu saved_interval=%lu elapsed=%lu startup_delay=%lu extra_advance=%lu wake_advance=%lu",
                     (unsigned long)wake_interval,
                     (unsigned long)TDX_SLIDESHOW_POWER_OFF_MIN_WAKE_INTERVAL_SECONDS,
                     (unsigned long)interval,
                     (unsigned long)runtime_elapsed,
                     (unsigned long)startup_delay,
                     (unsigned long)TDX_SLIDESHOW_WAKE_EXTRA_ADVANCE_SECONDS,
                     (unsigned long)wake_advance);
            return false;
        }

