tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
        bool work_time_expired = is_work_time_expired(
            elapsed, server_required_continue_work_time, local_image_one_shot);
        if (factory_reset_power_cycle_pending || work_time_expired) {
            uint32_t ota_hold_flags = __atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE);
            if (ota_hold_flags != 0) {
                if (counter == 0) {
                    ESP_LOGI(TAG,
                             "working_time timeout ignored during OTA elapsed=%lu target=%lu standby=%lu hold=0x%lx",
                             (unsigned long)elapsed,
                             (unsigned long)server_required_continue_work_time,
                             (unsigned long)wifi_standby_time_s,
                             (unsigned long)ota_hold_flags);
                }
            } else {
                TickType_t now = xTaskGetTickCount();
                TickType_t retry_interval_ticks = pdMS_TO_TICKS(20000);
                uint32_t wifi_connect_guard_remaining_ms =
                    ServerNetworkStaWifiWorkTime_GetWifiConnectGuardRemainingMs();
                if (wifi_connect_guard_remaining_ms > 0) {
                    uint32_t old_log_flags =
                        __atomic_fetch_or(&s_guard_log_flags,
                                          USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT,
                                          __ATOMIC_ACQ_REL);
                    if ((old_log_flags &
                         USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT) == 0) {
                        ESP_LOGI(TAG,
                                 "power off postponed by WiFi connect guard remaining_ms=%lu",
                                 (unsigned long)wifi_connect_guard_remaining_ms);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                (void)__atomic_fetch_and(
                    &s_guard_log_flags,
                    ~USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT,
                    __ATOMIC_ACQ_REL);
                if (ServerNetworkStaEpdDisplay_IsBusy()) {
                    if (counter == 0) {
                        ESP_LOGI(TAG,
                                 "working_time timeout postponed because EPD busy elapsed=%lu target=%lu standby=%lu",
                                 (unsigned long)elapsed,
                                 (unsigned long)server_required_continue_work_time,
                                 (unsigned long)wifi_standby_time_s);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                if (ServerNetworkStaWifiWorkTime_IsImageSaveInProgress()) {
                    if (counter == 0) {
                        ESP_LOGI(TAG,
                                 "power off postponed because image save busy elapsed=%lu target=%lu standby=%lu",
                                 (unsigned long)elapsed,
                                 (unsigned long)server_required_continue_work_time,
                                 (unsigned long)wifi_standby_time_s);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                if (ServerNetworkStaWifiWorkTime_IsDailyImageInProgress()) {
                    if (counter == 0) {
                        ESP_LOGI(TAG,
                                 "power off postponed because daily image busy elapsed=%lu target=%lu",
                                 (unsigned long)elapsed,
                                 (unsigned long)server_required_continue_work_time);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                uint32_t http_hold_remaining =
                    factory_reset_power_cycle_pending ? 0 :
                    http_activity_hold_remaining_seconds(now);
                if (http_hold_remaining > 0) {
                    uint32_t old_log_flags = __atomic_fetch_or(&s_guard_log_flags,
                                                               USER_WORK_STATE_GUARD_LOG_HTTP_BIT,
                                                               __ATOMIC_ACQ_REL);
                    if ((old_log_flags & USER_WORK_STATE_GUARD_LOG_HTTP_BIT) == 0) {
                        ESP_LOGI(TAG,
                                 "power off postponed by HTTP activity remaining=%lu elapsed=%lu target=%lu",
                                 (unsigned long)http_hold_remaining,
                                 (unsigned long)elapsed,
                                 (unsigned long)server_required_continue_work_time);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                (void)__atomic_fetch_and(&s_guard_log_flags,
                                         ~USER_WORK_STATE_GUARD_LOG_HTTP_BIT,
                                         __ATOMIC_ACQ_REL);
                uint32_t ch583_hold_remaining =
                    factory_reset_power_cycle_pending ? 0 :
                    ch583_activity_hold_remaining_seconds(now);
                if (ch583_hold_remaining > 0) {
                    uint32_t old_log_flags = __atomic_fetch_or(&s_guard_log_flags,
                                                               USER_WORK_STATE_GUARD_LOG_CH583_BIT,
                                                               __ATOMIC_ACQ_REL);
                    if ((old_log_flags & USER_WORK_STATE_GUARD_LOG_CH583_BIT) == 0) {
                        ESP_LOGI(TAG,
                                 "power off postponed by CH583 activity remaining=%lu elapsed=%lu target=%lu",
                                 (unsigned long)ch583_hold_remaining,
                                 (unsigned long)elapsed,
                                 (unsigned long)server_required_continue_work_time);
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                (void)__atomic_fetch_and(&s_guard_log_flags,
                                         ~USER_WORK_STATE_GUARD_LOG_CH583_BIT,
                                         __ATOMIC_ACQ_REL);
                if (EpdSdPowerTest_IsMandatoryCyclePending()) {
                    if (!power_cycle_guard_logged) {
                        power_cycle_guard_logged = true;
                        ESP_LOGI(TAG,
                                 "POWER_OFF postponed until mandatory EPD/SD power cycle completes");
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                if (power_cycle_guard_logged) {
                    power_cycle_guard_logged = false;
                    ESP_LOGI(TAG,
                             "mandatory EPD/SD power cycle complete; POWER_OFF may be reevaluated");
                }
                if (!factory_reset_power_cycle_pending &&
                    s_last_power_off_send_tick != 0 &&
                    (now - s_last_power_off_send_tick) < retry_interval_ticks) {
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                s_last_power_off_send_tick = now;

                if (!factory_reset_power_cycle_pending &&
                    should_skip_or_cancel_one_shot_power_off()) {
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                if (factory_reset_power_cycle_pending) {
                    ESP_LOGW(TAG,
                             "factory reset complete, evaluate CH583 power cycle wake_seconds=%lu",
                             (unsigned long)factory_reset_wake_seconds);
                } else {
                    ESP_LOGI(TAG,
                             "working_time timeout, evaluate CH583 power off elapsed=%lu target=%lu standby=%lu",
                             (unsigned long)elapsed,
                             (unsigned long)server_required_continue_work_time,
                             (unsigned long)wifi_standby_time_s);
                }
                bool slideshow_enabled_before_power_off = false;
                if (!configure_ch583_wake_timer_before_power_off(
                        &slideshow_enabled_before_power_off,
                        factory_reset_power_cycle_pending ?
                            factory_reset_wake_seconds : 0)) {
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                UserLedStatus_SetPowerOffPending(true);
                vTaskDelay(pdMS_TO_TICKS(100));
                esp_err_t led_ret = UserLedStatus_PreparePowerOffSync();
                if (led_ret != ESP_OK) {
                    UserLedStatus_SetPowerOffPending(false);
                    ESP_LOGE(TAG, "power off postponed because LED shutdown failed ret=%s",
                             esp_err_to_name(led_ret));
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "LED shutdown failure left CH583 wake timer rollback pending");
                    }
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                vTaskDelay(pdMS_TO_TICKS(100));
                uint32_t final_ota_hold_flags = __atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE);
                bool final_epd_busy = ServerNetworkStaEpdDisplay_IsBusy();
                bool final_image_save_busy = ServerNetworkStaWifiWorkTime_IsImageSaveInProgress();
                bool final_daily_image_busy =
                    ServerNetworkStaWifiWorkTime_IsDailyImageInProgress();
                TickType_t final_now = xTaskGetTickCount();
                uint32_t final_http_hold_remaining = http_activity_hold_remaining_seconds(final_now);
                uint32_t final_ch583_hold_remaining = ch583_activity_hold_remaining_seconds(final_now);
                uint32_t final_wifi_connect_guard_remaining_ms =
                    ServerNetworkStaWifiWorkTime_GetWifiConnectGuardRemainingMs();
                uint32_t final_elapsed = update_working_time_seconds();
                bool final_factory_reset_guard =
                    __atomic_load_n(&s_factory_reset_guard_active,
                                    __ATOMIC_ACQUIRE);
                bool final_factory_reset_request_changed =
                    !factory_reset_power_cycle_pending &&
                    __atomic_load_n(&s_factory_reset_wake_seconds,
                                    __ATOMIC_ACQUIRE) > 0;
                bool final_timer_active =
                    !factory_reset_power_cycle_pending &&
                    !is_work_time_expired(final_elapsed,
                                          server_required_continue_work_time,
                                          local_image_one_shot);
                if (factory_reset_power_cycle_pending) {
                    final_http_hold_remaining = 0;
                    final_ch583_hold_remaining = 0;
                }
                if (final_factory_reset_guard ||
                    final_factory_reset_request_changed ||
                    final_timer_active ||
                     final_ota_hold_flags != 0 ||
                     final_epd_busy ||
                     final_image_save_busy ||
                     final_daily_image_busy ||
                     final_http_hold_remaining > 0 ||
                     final_ch583_hold_remaining > 0 ||
                     final_wifi_connect_guard_remaining_ms > 0) {
                    ESP_LOGI(TAG,
                             "power off canceled by final guard factory_reset=%d timer=%d ota=0x%lx epd=%d image_save=%d daily=%d http_remaining=%lu ch583_remaining=%lu wifi_connect_remaining_ms=%lu",
                             (final_factory_reset_guard ||
                              final_factory_reset_request_changed) ? 1 : 0,
                             final_timer_active ? 1 : 0,
                             (unsigned long)final_ota_hold_flags,
                             final_epd_busy ? 1 : 0,
                             final_image_save_busy ? 1 : 0,
                             final_daily_image_busy ? 1 : 0,
                             (unsigned long)final_http_hold_remaining,
                             (unsigned long)final_ch583_hold_remaining,
                             (unsigned long)final_wifi_connect_guard_remaining_ms);
                    if (final_http_hold_remaining > 0) {
                        (void)__atomic_fetch_or(&s_guard_log_flags,
                                                USER_WORK_STATE_GUARD_LOG_HTTP_BIT,
                                                __ATOMIC_ACQ_REL);
                    }
                    if (final_ch583_hold_remaining > 0) {
                        (void)__atomic_fetch_or(&s_guard_log_flags,
                                                USER_WORK_STATE_GUARD_LOG_CH583_BIT,
                                                __ATOMIC_ACQ_REL);
                    }
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "final guard failed to release LED power-off lock, retry scheduled");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "final guard failed to cancel CH583 wake timer, retry scheduled");
                    }
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                esp_err_t spi_lock_ret =
                    TdxSharedSpi_Lock(pdMS_TO_TICKS(WORK_STATE_POWER_OFF_SPI_LOCK_TIMEOUT_MS));
                if (spi_lock_ret != ESP_OK) {
                    ESP_LOGE(TAG,
                             "power off postponed because shared SPI lock failed ret=%s",
                             esp_err_to_name(spi_lock_ret));
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "SPI lock failure left LED power-off cancellation pending");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "SPI lock failure left CH583 wake timer rollback pending");
                    }
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }

                uint32_t locked_ota_hold_flags =
                    __atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE);
                bool locked_epd_busy = ServerNetworkStaEpdDisplay_IsBusy();
                bool locked_image_save_busy =
                    ServerNetworkStaWifiWorkTime_IsImageSaveInProgress();
                bool locked_daily_image_busy =
                    ServerNetworkStaWifiWorkTime_IsDailyImageInProgress();
                TickType_t locked_now = xTaskGetTickCount();
                uint32_t locked_http_hold_remaining =
                    http_activity_hold_remaining_seconds(locked_now);
                uint32_t locked_ch583_hold_remaining =
                    ch583_activity_hold_remaining_seconds(locked_now);
                uint32_t locked_wifi_connect_guard_remaining_ms =
                    ServerNetworkStaWifiWorkTime_GetWifiConnectGuardRemainingMs();
                uint32_t locked_elapsed = update_working_time_seconds();
                bool locked_factory_reset_guard =
                    __atomic_load_n(&s_factory_reset_guard_active,
                                    __ATOMIC_ACQUIRE);
                bool locked_factory_reset_request_changed =
                    !factory_reset_power_cycle_pending &&
                    __atomic_load_n(&s_factory_reset_wake_seconds,
                                    __ATOMIC_ACQUIRE) > 0;
                bool locked_timer_active =
                    !factory_reset_power_cycle_pending &&
                    !is_work_time_expired(locked_elapsed,
                                          server_required_continue_work_time,
                                          local_image_one_shot);
                if (factory_reset_power_cycle_pending) {
                    locked_http_hold_remaining = 0;
                    locked_ch583_hold_remaining = 0;
                }
                if (locked_factory_reset_guard ||
                    locked_factory_reset_request_changed ||
                    locked_timer_active ||
                     locked_ota_hold_flags != 0 ||
                     locked_epd_busy ||
                     locked_image_save_busy ||
                     locked_daily_image_busy ||
                     locked_http_hold_remaining > 0 ||
                     locked_ch583_hold_remaining > 0 ||
                     locked_wifi_connect_guard_remaining_ms > 0) {
                    ESP_LOGI(TAG,
                             "power off canceled by locked guard factory_reset=%d timer=%d ota=0x%lx epd=%d image_save=%d daily=%d http_remaining=%lu ch583_remaining=%lu wifi_connect_remaining_ms=%lu",
                             (locked_factory_reset_guard ||
                              locked_factory_reset_request_changed) ? 1 : 0,
                             locked_timer_active ? 1 : 0,
                             (unsigned long)locked_ota_hold_flags,
                             locked_epd_busy ? 1 : 0,
                             locked_image_save_busy ? 1 : 0,
                             locked_daily_image_busy ? 1 : 0,
                             (unsigned long)locked_http_hold_remaining,
                             (unsigned long)locked_ch583_hold_remaining,
                             (unsigned long)locked_wifi_connect_guard_remaining_ms);
                    TdxSharedSpi_Unlock();
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "locked guard failed to release LED power-off lock");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "locked guard failed to cancel CH583 wake timer");
                    }
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }

