tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
                int provision_ret =
                    ch583_wifi_uart_send_wifi_provision_mode_before_power_off(
                        EpdDisplayMode_Get());
                if (provision_ret < 0) {
                    // WIFI_PROVISION is an advisory notification. Keep the original
                    // POWER_OFF behavior even when this extra UART write fails.
                    ESP_LOGE(TAG,
                             "pre-power-off WIFI_PROVISION send failed mode=%u ret=%d",
                             (unsigned int)EpdDisplayMode_Get(),
                             provision_ret);
                } else {
                    ESP_LOGI(TAG,
                             "pre-power-off WIFI_PROVISION sent mode=%u(%s)",
                             (unsigned int)EpdDisplayMode_Get(),
                             EpdDisplayMode_ToString(EpdDisplayMode_Get()));
                    vTaskDelay(pdMS_TO_TICKS(100));
                }

                esp_err_t power_decision_ret =
                    EpdSdPowerTest_CommitImmediatePowerOff();
                if (power_decision_ret != ESP_OK) {
                    ESP_LOGW(TAG,
                             "POWER_OFF postponed because post-display power decision is not ready ret=%s",
                             esp_err_to_name(power_decision_ret));
                    TdxSharedSpi_Unlock();
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "power decision failure left LED cancellation pending");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "power decision failure left CH583 wake timer rollback pending");
                    }
                    s_last_power_off_send_tick = 0;
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }

                int power_off_ret = ch583_wifi_uart_send_power_off();
                if (power_off_ret < 0) {
                    ESP_LOGE(TAG, "CH583 POWER_OFF UART send failed ret=%d", power_off_ret);
                    EpdSdPowerTest_CommitStayAwake("ch583_power_off_send_failed");
                    if (provision_ret == 0) {
                        int restore_ret =
                            ch583_wifi_uart_send_current_wifi_provision_status();
                        if (restore_ret < 0) {
                            ESP_LOGE(TAG,
                                     "WIFI_PROVISION restore after POWER_OFF failure failed ret=%d",
                                     restore_ret);
                        }
                    }
                    TdxSharedSpi_Unlock();
                    (void)__atomic_fetch_or(&s_runtime_state_flags,
                                            USER_WORK_STATE_RUNTIME_LED_CANCEL_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
                    if (!retry_pending_led_power_off_cancel()) {
                        ESP_LOGE(TAG, "POWER_OFF failure left LED cancellation pending");
                    }
                    if (!retry_pending_wake_timer_cancel()) {
                        ESP_LOGE(TAG, "POWER_OFF failure left CH583 wake timer rollback pending");
                    }
                } else {
                    if (factory_reset_power_cycle_pending) {
                        __atomic_store_n(&s_factory_reset_wake_seconds,
                                         0,
                                         __ATOMIC_RELEASE);
                    }
                    // The configured wake timer now belongs to the accepted power-off attempt.
                    (void)__atomic_fetch_and(&s_runtime_state_flags,
                                             ~USER_WORK_STATE_RUNTIME_WAKE_TIMER_CANCEL_PENDING_BIT,
                                             __ATOMIC_ACQ_REL);
#if USER_POWER_OFF_LOCAL_EPD_SD_CUTOFF_ENABLE
                    esp_err_t power_ret = ServerNetworkStaEpdDisplay_SetPower(false);
                    if (power_ret != ESP_OK) {
                        ESP_LOGE(TAG,
                                 "POWER_OFF sent but EPD/SD power off failed ret=%s",
                                 esp_err_to_name(power_ret));
                    } else {
                        ESP_LOGI(TAG, "POWER_OFF sent and EPD/SD power switched off");
                    }
#else
                    // CH583 still owns ESP32/WiFi shutdown. Keep GPIO4 high so a rejected
                    // or ineffective POWER_OFF cannot leave the mounted SD/EPD unpowered.
                    ESP_LOGI(TAG, "POWER_OFF sent; keep local EPD/SD power on while waiting for CH583");
#endif

                    // If CH583 does not cut ESP32-C5 power, keep the original restart fallback.
                    vTaskDelay(pdMS_TO_TICKS(WORK_STATE_POWER_OFF_CUT_WAIT_MS));
                    ESP_LOGE(TAG, "CH583 did not cut power after POWER_OFF, restart");
                    esp_restart();
                }
            }
        } else {
            s_last_power_off_send_tick = 0;
            (void)__atomic_fetch_and(&s_guard_log_flags,
                                     ~(USER_WORK_STATE_GUARD_LOG_HTTP_BIT |
                                       USER_WORK_STATE_GUARD_LOG_CH583_BIT |
                                       USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT),
                                     __ATOMIC_ACQ_REL);
        }

        vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
    }
}

static const char *find_json_key(const char *body, const char *key)
{
    char pattern[64];
    const char *pos = body;
    if (body == NULL || key == NULL) {
        return NULL;
    }
    snprintf(pattern, sizeof(pattern), "\"%s\"", key);
    while ((pos = strstr(pos, pattern)) != NULL) {
        const char *after = pos + strlen(pattern);
        while (*after == ' ' || *after == '\t' || *after == '\r' || *after == '\n') {
            after++;
        }
        if (*after == ':') {
            return pos;
        }
        pos += strlen(pattern);
    }
    return NULL;
}

static bool json_func_equals(const char *body, const char *func)
{
    const char *pos = find_json_key(body, "func");
    if (pos == NULL || func == NULL) {
        return false;
    }

    pos += strlen("func") + 2;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if (*pos != ':') {
        return false;
    }
    pos++;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if (*pos != '"') {
        return false;
    }
    pos++;

