tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
    size_t func_len = strlen(func);
    return strncmp(pos, func, func_len) == 0 && pos[func_len] == '"';
}

static bool parse_json_int(const char *body, const char *key, int *out)
{
    const char *pos = find_json_key(body, key);
    char *end_ptr = NULL;
    long value = 0;
    if (pos == NULL || out == NULL) {
        return false;
    }

    pos += strlen(key) + 2;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if (*pos != ':') {
        return false;
    }
    pos++;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if ((*pos == '-' && (pos[1] < '0' || pos[1] > '9')) ||
        (*pos != '-' && (*pos < '0' || *pos > '9'))) {
        return false;
    }

    errno = 0;
    value = strtol(pos, &end_ptr, 10);
    if (errno != 0 || end_ptr == pos || value < INT32_MIN || value > INT32_MAX) {
        return false;
    }
    while (*end_ptr == ' ' || *end_ptr == '\t' || *end_ptr == '\r' || *end_ptr == '\n') {
        end_ptr++;
    }
    if (*end_ptr != ',' && *end_ptr != '}') {
        return false;
    }
    *out = (int)value;
    return true;
}

static esp_err_t send_wifi_work_time_result(httpd_req_t *req, int result, const char *message)
{
    char json[176];
    if (result == TDX_JSON_RESULT_OK) {
        snprintf(json, sizeof(json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d}",
                 TDX_JSON_RESULT_OK);
    } else {
        snprintf(json, sizeof(json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d,\"message\":\"%s\"}",
                 result,
                 message != NULL ? message : "set wifi work time failed");
    }

    ESP_LOGI(TAG, "set_wifi_work_time response: %s", json);
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_sendstr(req, json);
}

void ServerNetworkStaWifiWorkTime_OnNetworkData(void)
{
    working_time = 0;
    s_last_network_data_tick = xTaskGetTickCount();
    s_wifi_work_start_tick = s_last_network_data_tick;
    s_last_power_off_send_tick = 0;
    if (server_required_continue_work_time > 0) {
        ESP_LOGI(TAG, "activity reset working_time continue=%lu elapsed_ms=%u",
                 (unsigned long)server_required_continue_work_time,
                 (unsigned int)((s_last_network_data_tick - s_wifi_work_start_tick) * portTICK_PERIOD_MS));
    }
}

void ServerNetworkStaWifiWorkTime_OnHttpNetworkActivity(void)
{
    TickType_t now = xTaskGetTickCount();
    uint32_t encoded_tick = (uint32_t)now + 1U;
    if (encoded_tick == 0) {
        encoded_tick = 1U;
    }
    __atomic_store_n(&s_last_http_activity_tick_encoded, encoded_tick, __ATOMIC_RELEASE);
    s_last_power_off_send_tick = 0;
}

void ServerNetworkStaWifiWorkTime_OnCh583Activity(void)
{
    TickType_t now = xTaskGetTickCount();
    uint32_t encoded_tick = (uint32_t)now + 1U;
    if (encoded_tick == 0) {
        encoded_tick = 1U;
    }
    __atomic_store_n(&s_last_ch583_activity_tick_encoded, encoded_tick, __ATOMIC_RELEASE);
    s_last_power_off_send_tick = 0;
}

static uint32_t wifi_connect_guard_bounded_timeout_ms(uint32_t timeout_ms)
{
    uint32_t bounded_ms = timeout_ms;
    if (bounded_ms == 0 || bounded_ms > WIFI_CONNECT_POWER_GUARD_MAX_MS) {
        bounded_ms = WIFI_CONNECT_POWER_GUARD_MAX_MS;
    }
    return bounded_ms;
}

static uint32_t wifi_connect_guard_encoded_deadline(uint32_t timeout_ms)
{
    uint32_t bounded_ms = wifi_connect_guard_bounded_timeout_ms(timeout_ms);
    TickType_t deadline = xTaskGetTickCount() + pdMS_TO_TICKS(bounded_ms);
    uint32_t encoded_deadline = (uint32_t)deadline + 1U;
    if (encoded_deadline == 0) {
        encoded_deadline = 1U;
    }
    return encoded_deadline;
}

void ServerNetworkStaWifiWorkTime_StartWifiConnectGuard(uint32_t timeout_ms)
{
    uint32_t bounded_ms = wifi_connect_guard_bounded_timeout_ms(timeout_ms);
    uint32_t encoded_deadline =
        wifi_connect_guard_encoded_deadline(bounded_ms);
    __atomic_store_n(&s_wifi_connect_guard_deadline_encoded,
                     encoded_deadline,
                     __ATOMIC_RELEASE);
    (void)__atomic_fetch_and(&s_guard_log_flags,
                             ~USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT,
                             __ATOMIC_ACQ_REL);
    s_last_power_off_send_tick = 0;
    ESP_LOGI(TAG, "WiFi connect power guard started timeout_ms=%lu",
             (unsigned long)bounded_ms);
}

bool ServerNetworkStaWifiWorkTime_StartWifiConnectGuardIfInactive(
    uint32_t timeout_ms)
{
    uint32_t remaining_ms =
        ServerNetworkStaWifiWorkTime_GetWifiConnectGuardRemainingMs();
    if (remaining_ms > 0) {
        ESP_LOGI(TAG,
                 "WiFi connect power guard reused remaining_ms=%lu",
                 (unsigned long)remaining_ms);
        return false;
    }

    uint32_t bounded_ms = wifi_connect_guard_bounded_timeout_ms(timeout_ms);
    uint32_t encoded_deadline =
        wifi_connect_guard_encoded_deadline(bounded_ms);
    uint32_t expected = 0;
    if (!__atomic_compare_exchange_n(&s_wifi_connect_guard_deadline_encoded,
                                     &expected,
                                     encoded_deadline,
                                     false,
                                     __ATOMIC_ACQ_REL,
                                     __ATOMIC_ACQUIRE)) {
        remaining_ms =
            ServerNetworkStaWifiWorkTime_GetWifiConnectGuardRemainingMs();
        ESP_LOGI(TAG,
                 "WiFi connect power guard reused after concurrent start remaining_ms=%lu",
                 (unsigned long)remaining_ms);
        return false;
    }

    (void)__atomic_fetch_and(&s_guard_log_flags,
                             ~USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT,
                             __ATOMIC_ACQ_REL);
    s_last_power_off_send_tick = 0;
    ESP_LOGI(TAG,
             "WiFi connect power guard started if inactive timeout_ms=%lu",
             (unsigned long)bounded_ms);
    return true;
}

void ServerNetworkStaWifiWorkTime_ClearWifiConnectGuard(const char *reason)
{
    uint32_t old_deadline =
        __atomic_exchange_n(&s_wifi_connect_guard_deadline_encoded,
                            0,
                            __ATOMIC_ACQ_REL);
    (void)__atomic_fetch_and(&s_guard_log_flags,
                             ~USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT,
                             __ATOMIC_ACQ_REL);
    if (old_deadline != 0) {
        s_last_power_off_send_tick = 0;
        ESP_LOGI(TAG, "WiFi connect power guard cleared reason=%s",
                 reason != NULL ? reason : "unknown");
    }
}

