tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
uint32_t ServerNetworkStaWifiWorkTime_GetWifiConnectGuardRemainingMs(void)
{
    uint32_t encoded_deadline =
        __atomic_load_n(&s_wifi_connect_guard_deadline_encoded,
                        __ATOMIC_ACQUIRE);
    if (encoded_deadline == 0) {
        return 0;
    }

    TickType_t deadline = (TickType_t)(encoded_deadline - 1U);
    TickType_t now = xTaskGetTickCount();
    int32_t remaining_ticks = (int32_t)(deadline - now);
    if (remaining_ticks <= 0) {
        uint32_t expected = encoded_deadline;
        if (__atomic_compare_exchange_n(&s_wifi_connect_guard_deadline_encoded,
                                        &expected,
                                        0,
                                        false,
                                        __ATOMIC_ACQ_REL,
                                        __ATOMIC_ACQUIRE)) {
            (void)__atomic_fetch_and(&s_guard_log_flags,
                                     ~USER_WORK_STATE_GUARD_LOG_WIFI_CONNECT_BIT,
                                     __ATOMIC_ACQ_REL);
            ESP_LOGW(TAG, "WiFi connect power guard deadline reached");
        }
        return 0;
    }

    return (uint32_t)pdTICKS_TO_MS((TickType_t)remaining_ticks);
}

void ServerNetworkStaWifiWorkTime_OnCh583Initialized(void)
{
    // Record the timed hold before releasing the startup guard so shutdown cannot race initialization.
    ServerNetworkStaWifiWorkTime_OnCh583Activity();
    uint32_t old_flags = __atomic_fetch_and(&s_runtime_state_flags,
                                            ~USER_WORK_STATE_RUNTIME_CH583_STARTUP_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
    if ((old_flags & USER_WORK_STATE_RUNTIME_CH583_STARTUP_PENDING_BIT) != 0) {
        ESP_LOGI(TAG, "CH583 startup guard released, activity hold started seconds=%u",
                 (unsigned int)USER_WORK_STATE_CH583_ACTIVITY_HOLD_SECONDS);
    }
}

bool ServerNetworkStaWifiWorkTime_ShouldAwaitPostDisplayPowerDecision(void)
{
    uint8_t mode = EpdDisplayMode_Get();
    return mode == USER_EPD_DISPLAY_MODE_DAILY ||
           mode == USER_EPD_DISPLAY_MODE_SLIDESHOW ||
           mode == USER_EPD_DISPLAY_MODE_LOCAL_IMAGE_BROWSING;
}

static void request_owned_one_shot_power_off_countdown(uint32_t seconds,
                                                       uint8_t owner)
{
    if (seconds == 0) {
        return;
    }
    /*
     * Keep an active one-shot deadline stable. The daily worker periodically
     * checks that shutdown is progressing, so resetting the counter here can
     * race the final power-off guard and cause an unnecessary cancel/retry.
     */
    TickType_t request_tick = xTaskGetTickCount();
    portENTER_CRITICAL(&s_one_shot_power_off_mux);
    uint8_t one_shot_state =
        __atomic_load_n(&s_one_shot_power_off_state, __ATOMIC_ACQUIRE);
    if ((one_shot_state & USER_WORK_STATE_ONE_SHOT_ACTIVE_BIT) != 0) {
        uint8_t updated_state = one_shot_state;
        if (owner != 0) {
            updated_state =
                (one_shot_state & ~USER_WORK_STATE_ONE_SHOT_OWNER_MASK) | owner;
        }
        __atomic_store_n(&s_one_shot_power_off_state,
                         updated_state,
                         __ATOMIC_RELEASE);
        uint32_t active_target = server_required_continue_work_time;
        portEXIT_CRITICAL(&s_one_shot_power_off_mux);
        ESP_LOGI(TAG,
                 "one-shot power off countdown already active owner=%s keep target=%lu",
                 one_shot_owner_to_string(updated_state &
                                          USER_WORK_STATE_ONE_SHOT_OWNER_MASK),
                 (unsigned long)active_target);
        return;
    }
    s_one_shot_restore_continue_time = server_required_continue_work_time;
    s_one_shot_restore_standby_time = wifi_standby_time_s;

    server_required_continue_work_time = seconds;
    wifi_standby_time_s = seconds;
    working_time = 0;
    s_wifi_work_start_tick = request_tick;
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    one_shot_state = USER_WORK_STATE_ONE_SHOT_ACTIVE_BIT | owner;
    __atomic_store_n(&s_one_shot_power_off_state, one_shot_state, __ATOMIC_RELEASE);
    portEXIT_CRITICAL(&s_one_shot_power_off_mux);
    UserLedStatus_SetPowerOffPending(true);

    ESP_LOGI(TAG,
             "one-shot power off countdown requested owner=%s target=%lu standby=%lu",
             one_shot_owner_to_string(owner),
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s);
}

void ServerNetworkStaWifiWorkTime_RequestOneShotPowerOffCountdown(uint32_t seconds)
{
    uint8_t owner =
        EpdDisplayMode_Get() == USER_EPD_DISPLAY_MODE_DAILY
            ? USER_WORK_STATE_ONE_SHOT_DAILY_OWNER_BIT
            : 0;
    request_owned_one_shot_power_off_countdown(seconds, owner);
}

void ServerNetworkStaWifiWorkTime_RequestDailyPowerOffCountdown(uint32_t seconds)
{
    request_owned_one_shot_power_off_countdown(
        seconds, USER_WORK_STATE_ONE_SHOT_DAILY_OWNER_BIT);
}

void ServerNetworkStaWifiWorkTime_RequestSlideshowPowerOffCountdown(uint32_t seconds)
{
    request_owned_one_shot_power_off_countdown(
        seconds, USER_WORK_STATE_ONE_SHOT_SLIDESHOW_OWNER_BIT);
}

void ServerNetworkStaWifiWorkTime_RequestLocalImagePowerOffCountdown(uint32_t seconds)
{
    request_owned_one_shot_power_off_countdown(
        seconds, USER_WORK_STATE_ONE_SHOT_LOCAL_IMAGE_OWNER_BIT);
}

void ServerNetworkStaWifiWorkTime_SetFactoryResetGuard(bool active)
{
    __atomic_store_n(&s_factory_reset_guard_active,
                     active,
                     __ATOMIC_RELEASE);
    if (!active) {
        s_last_power_off_send_tick = 0;
    }
}

void ServerNetworkStaWifiWorkTime_RequestFactoryResetPowerCycle(uint32_t wake_seconds)
{
    if (wake_seconds == 0) {
        return;
    }

    __atomic_store_n(&s_factory_reset_wake_seconds,
                     wake_seconds,
                     __ATOMIC_RELEASE);
    s_last_power_off_send_tick = 0;
    UserLedStatus_SetPowerOffPending(true);
    ESP_LOGW(TAG,
             "factory reset CH583 power cycle requested wake_seconds=%lu",
             (unsigned long)wake_seconds);
}

void ServerNetworkStaWifiWorkTime_SetImageSaveInProgress(bool in_progress)
{
    bool old_value = __atomic_exchange_n(&s_image_save_in_progress, in_progress, __ATOMIC_ACQ_REL);
    if (old_value != in_progress) {
        ESP_LOGI(TAG, "image save in progress=%d", in_progress ? 1 : 0);
    }
}

bool ServerNetworkStaWifiWorkTime_IsImageSaveInProgress(void)
{
    return __atomic_load_n(&s_image_save_in_progress, __ATOMIC_ACQUIRE) ||
           __atomic_load_n(&s_image_transfer_pending_count, __ATOMIC_ACQUIRE) > 0U;
}

void ServerNetworkStaWifiWorkTime_ImageTransferBegin(void)
{
    uint32_t count =
        __atomic_add_fetch(&s_image_transfer_pending_count, 1U, __ATOMIC_ACQ_REL);
    ESP_LOGI(TAG, "image transfer pending count=%lu", (unsigned long)count);
}

