tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
void ServerNetworkStaWifiWorkTime_ImageTransferEnd(void)
{
    uint32_t current =
        __atomic_load_n(&s_image_transfer_pending_count, __ATOMIC_ACQUIRE);
    while (current > 0U) {
        if (__atomic_compare_exchange_n(&s_image_transfer_pending_count,
                                        &current,
                                        current - 1U,
                                        false,
                                        __ATOMIC_ACQ_REL,
                                        __ATOMIC_ACQUIRE)) {
            ESP_LOGI(TAG, "image transfer pending count=%lu",
                     (unsigned long)(current - 1U));
            return;
        }
    }
    ESP_LOGE(TAG, "image transfer pending underflow prevented");
}

void ServerNetworkStaWifiWorkTime_SetDailyImageInProgress(bool in_progress)
{
    bool old_value = __atomic_exchange_n(&s_daily_image_in_progress,
                                         in_progress,
                                         __ATOMIC_ACQ_REL);
    if (old_value != in_progress) {
        ESP_LOGI(TAG, "daily image in progress=%d", in_progress ? 1 : 0);
    }
}

bool ServerNetworkStaWifiWorkTime_IsDailyImageInProgress(void)
{
    return __atomic_load_n(&s_daily_image_in_progress, __ATOMIC_ACQUIRE);
}

void ServerNetworkStaWifiWorkTime_SetOtaWriteInProgress(bool in_progress)
{
    if (in_progress) {
        (void)__atomic_fetch_or(&s_ota_hold_flags,
                                USER_WORK_STATE_OTA_HOLD_WRITE_BIT,
                                __ATOMIC_ACQ_REL);
    } else {
        (void)__atomic_fetch_and(&s_ota_hold_flags,
                                 ~USER_WORK_STATE_OTA_HOLD_WRITE_BIT,
                                 __ATOMIC_ACQ_REL);
    }
    ESP_LOGI(TAG, "ota write in progress=%d hold=0x%lx",
             in_progress ? 1 : 0,
             (unsigned long)__atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE));
}

void ServerNetworkStaWifiWorkTime_SetOtaReceiveInProgress(bool in_progress)
{
    if (in_progress) {
        (void)__atomic_fetch_or(&s_ota_hold_flags,
                                USER_WORK_STATE_OTA_HOLD_RECEIVE_BIT,
                                __ATOMIC_ACQ_REL);
    } else {
        (void)__atomic_fetch_and(&s_ota_hold_flags,
                                 ~USER_WORK_STATE_OTA_HOLD_RECEIVE_BIT,
                                 __ATOMIC_ACQ_REL);
    }
    ESP_LOGI(TAG, "ota receive in progress=%d hold=0x%lx",
             in_progress ? 1 : 0,
             (unsigned long)__atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE));
}

void ServerNetworkStaWifiWorkTime_SetOtaPendingVerify(bool pending)
{
    if (pending) {
        (void)__atomic_fetch_or(&s_ota_hold_flags,
                                USER_WORK_STATE_OTA_HOLD_PENDING_VERIFY_BIT,
                                __ATOMIC_ACQ_REL);
    } else {
        (void)__atomic_fetch_and(&s_ota_hold_flags,
                                 ~USER_WORK_STATE_OTA_HOLD_PENDING_VERIFY_BIT,
                                 __ATOMIC_ACQ_REL);
    }
    ESP_LOGI(TAG, "ota pending verify=%d hold=0x%lx",
             pending ? 1 : 0,
             (unsigned long)__atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE));
}

bool ServerNetworkStaWifiWorkTime_IsOtaBusy(void)
{
    return __atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE) != 0U;
}

esp_err_t ServerNetworkStaWifiWorkTime_Init(void)
{
    user_work_state_nvs_blob_t blob = {0};
    size_t stored_size = 0;

    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    (void)__atomic_fetch_or(&s_runtime_state_flags,
                            USER_WORK_STATE_RUNTIME_CH583_STARTUP_PENDING_BIT,
                            __ATOMIC_ACQ_REL);
    ESP_LOGI(TAG, "CH583 startup guard active until UART initialization completes");
    esp_err_t ret = load_work_state_from_nvs(&blob, &stored_size);
    if (ret == ESP_OK) {
        log_work_state_blob("read value", &blob);
        apply_work_state_blob(&blob);
    } else {
        sleep_time = 0;
        working_time = 0;
        server_required_continue_work_time = USER_WORK_STATE_DEFAULT_CONTINUE_SECONDS;
        wifi_standby_time_s = USER_WORK_STATE_DEFAULT_STANDBY_SECONDS;
        ESP_LOGW(TAG, "use default work state ret=%s stored_size=%u continue=%lu standby=%lu",
                 esp_err_to_name(ret), (unsigned int)stored_size,
                 (unsigned long)server_required_continue_work_time,
                 (unsigned long)wifi_standby_time_s);
        ret = save_work_state_to_nvs();
    }

    load_work_time_vars_from_app_nvs();
    esp_err_t app_nvs_ret = save_work_time_vars_to_app_nvs();
    if (ret == ESP_OK && app_nvs_ret != ESP_OK) {
        ret = app_nvs_ret;
    }

    if (s_work_state_task == NULL) {
        BaseType_t task_ret = xTaskCreate(work_state_task,
                                          "work_state",
                                          USER_WORK_STATE_TASK_STACK_SIZE,
                                          NULL,
                                          USER_WORK_STATE_TASK_PRIORITY,
                                          &s_work_state_task);
        if (task_ret != pdPASS) {
            ESP_LOGE(TAG, "create work_state task failed");
            return ESP_ERR_NO_MEM;
        }
    }

    return ret;
}

esp_err_t ServerNetworkStaWifiWorkTime_SetAndSave(uint32_t seconds)
{
    if (s_work_state_task == NULL) {
        ESP_LOGE(TAG, "set work time apply failed because work_state task is not ready");
        return ESP_ERR_INVALID_STATE;
    }

    server_required_continue_work_time = clamp_continue_seconds(seconds);
    wifi_standby_time_s = seconds;
    working_time = 0;
    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    __atomic_store_n(&s_one_shot_power_off_state, 0, __ATOMIC_RELEASE);
    UserLedStatus_SetPowerOffPending(false);

    ESP_LOGI(TAG, "set work time requested=%lu continue=%lu standby=%lu",
             (unsigned long)seconds,
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s);
    esp_err_t ret = save_work_state_to_nvs();
    esp_err_t app_nvs_ret = save_work_time_vars_to_app_nvs();
    if (ret == ESP_OK && app_nvs_ret != ESP_OK) {
        ret = app_nvs_ret;
    }
    ESP_LOGI(TAG, "set work time save ret=%s app_nvs_ret=%s",
             esp_err_to_name(ret),
             esp_err_to_name(app_nvs_ret));
    return ret;
}

